st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Provider_CLI_RTOS/Src/usbpd_dpm_user.c
}

/**
  * @brief  Request the PE to perform a VCONN Swap.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestVconnSwap(uint8_t PortNum)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_VCONN_SWAP, USBPD_SOPTYPE_SOP);
}

/**
  * @brief  Request the PE to send a soft reset
  * @param  PortNum The current port number
  * @param  SOPType SOP Type based on @ref USBPD_SOPType_TypeDef
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestSoftReset(uint8_t PortNum, USBPD_SOPType_TypeDef SOPType)
{
  return USBPD_PE_Request_CtrlMessage(PortNum, USBPD_CONTROLMSG_SOFT_RESET, SOPType);
}

/**
  * @brief  Request the PE to send a Source Capability message.
  * @param  PortNum The current port number
  * @retval USBPD Status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestSourceCapability(uint8_t PortNum)
{
  /* PE will directly get the PDO saved in structure @ref PWR_Port_PDO_Storage */
  return USBPD_PE_Request_DataMessage(PortNum, USBPD_DATAMSG_SRC_CAPABILITIES, NULL, 0);
}



/**
  * @}
  */

/**
  * @brief  Prepare sending of a new Request according to Capabilities Message from Source port
  * @param  PortNum   Index of current used port
  * @retval PDOIndex  Index of PDO within source capabilities message
  *                   PDOIndex must be from 1 to Number of received profiles
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_RequestNewPowerProfile(uint8_t PortNum, uint8_t PDOIndex)
{
  return USBPD_ERROR;
}

/**
  * @brief
  * @param  PortNum Index of current used port
  * @param
  * @retval None.
  */
USBPD_StatusTypeDef USBPD_DPM_CLI_GetStatusInfo(uint8_t PortNum, uint8_t *pProfile, float *pVoltage, uint32_t *pCurrentPDO)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  USBPD_PortPowerRole_TypeDef role = USBPD_PORTPOWERROLE_SNK;
  if (DPM_Ports[PortNum].DPM_IsConnected)
  {
    role = DPM_Params[PortNum].PE_PowerRole;
    if (role == USBPD_PORTPOWERROLE_SNK)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_RDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RequestDOMsg;
        ret = USBPD_OK;
      }
    }
    if (role == USBPD_PORTPOWERROLE_SRC)
    {
      if (pProfile)
      {
        *pProfile = DPM_Ports[PortNum].DPM_RDOPosition;
        ret = USBPD_OK;
      }
      if (pVoltage)
      {
        *pVoltage = ((float)DPM_Ports[PortNum].DPM_RequestedVoltage) / 1000.0;
        ret = USBPD_OK;
      }
      if (pCurrentPDO)
      {
        *pCurrentPDO = DPM_Ports[PortNum].DPM_RcvRequestDOMsg;
        ret = USBPD_OK;
      }
    }
  }
  return ret;
}

/**
  * @brief  Get PE connection status
  * @param  PortNum           Index of current used port
  * @param  pConnectionStatus Pointer on PE connection status
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_CLI_GetConnectionStatus(uint8_t PortNum, int8_t *pConnectionStatus)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  if (pConnectionStatus)
  {
    *pConnectionStatus = DPM_Params[PortNum].PE_IsConnected == USBPD_FALSE ? 0x00 : (DPM_Params[PortNum].PE_Power + 1);
    ret = USBPD_OK;
  }
  return ret;
}

/**
  * @brief  Get current power role
  * @param  PortNum           Index of current used port
  * @param  pPortPowerRole    Pointer on the current power role based on @ref USBPD_PortPowerRole_TypeDef
  * @param  pConnectionStatus Pointer on the connection status
  * @param  pDrpSupport       Pointer on boolean indicating DRP support
  * @retval USBPD status
  */
USBPD_StatusTypeDef USBPD_DPM_CLI_GetCurrentRole(uint8_t PortNum, USBPD_PortPowerRole_TypeDef *pPortPowerRole, int8_t * pConnectionStatus, uint8_t *pDrpSupport)
{
  USBPD_StatusTypeDef ret = USBPD_ERROR;
  USBPD_PortPowerRole_TypeDef portPowerRole = USBPD_PORTPOWERROLE_SNK;
  int8_t connectionStatus = DPM_Params[PortNum].PE_Power;
  if (pPortPowerRole)
  {
    /* check the role according to the connection status */
    if (!connectionStatus)
    {
      /* unplugged => using the default role */
      portPowerRole = DPM_Settings[PortNum].PE_DefaultRole;
    }
    else
    {
      /* plugged => using the current role */
      portPowerRole = DPM_Params[PortNum].PE_PowerRole;
    }
    *pPortPowerRole = portPowerRole;
    ret = USBPD_OK;
  }
  if (pConnectionStatus)
  {
    *pConnectionStatus = connectionStatus;
  }
  if (pDrpSupport)
  {
    *pDrpSupport = DPM_Settings[PortNum].CAD_RoleToggle;
  }
  
  return ret;
}

/**
  * @brief  Get active CC line
  * @param  PortNum Index of current used port
  * @retval Active CC line based on @ref CCxPin_TypeDef
  */
CCxPin_TypeDef USBPD_DPM_CLI_GetCCLine(uint8_t PortNum)
{
  return DPM_Params[PortNum].ActiveCCIs;
}

/** @addtogroup USBPD_USER_PRIVATE_FUNCTIONS
  * @{
  */


/**
  * @brief  Turn Off power supply.
  * @param  PortNum The current port number
  * @retval USBPD_OK, USBPD_ERROR
  */
static USBPD_StatusTypeDef DPM_TurnOffPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  USBPD_StatusTypeDef status = USBPD_OK;

  status = USBPD_PWR_IF_VBUSDisable(PortNum);
  if(USBPD_PORTPOWERROLE_SRC == Role)
  {
    /* wait until discharge vbus */
    USBPD_DPM_WaitForTime(30);
    /* Disable discharge path (to avoid other consumption) */
    USBPD_PWR_IF_DISABLE_DISCHARGE_PATH(PortNum);
  }
  Led_Set((PortNum == USBPD_PORT_0 ? LED_PORT0_VBUS : LED_PORT1_VBUS) , LED_MODE_OFF, 0);
  return status;
}

/**
  * @brief  Turn On power supply.
  * @param  PortNum The current port number
  * @retval USBPD_ACCEPT, USBPD_WAIT, USBPD_REJECT
  */
static USBPD_StatusTypeDef DPM_TurnOnPower(uint8_t PortNum, USBPD_PortPowerRole_TypeDef Role)
{
  USBPD_StatusTypeDef status = USBPD_OK;
  /* Enable the output */
  status = USBPD_PWR_IF_VBUSEnable(PortNum);
  if(USBPD_PORTPOWERROLE_SRC == Role)
  {
    /* Enable the output */
    USBPD_DPM_WaitForTime(30);
  }
  else
  {
    /* stop current sink */
  }

  /* Led feedback */
  Led_Set((PortNum == USBPD_PORT_0 ? LED_PORT0_VBUS : LED_PORT1_VBUS) , LED_MODE_BLINK_VBUS, 0);

  return status;
}

/**
  * @brief  Assert Rp resistor.
  * @param  PortNum The current port number
  * @retval None
  */
static void DPM_AssertRp(uint8_t PortNum)
{
  USBPD_CAD_AssertRp(PortNum);

  Led_Set((PortNum == USBPD_PORT_0 ? LED_PORT0_ROLE : LED_PORT1_ROLE) , LED_MODE_BLINK_ROLE_SRC, 0);
}


static uint32_t CheckDPMTimers(void)
{
  uint32_t _timing = osWaitForever;

  return _timing;
}

/**
  * @}
  */

/**
  * @}
  */

/** 
  * @}
  */

/** 
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
